{
  "auto_mapping": null,
  "base_model_name_or_path": "roberta-large",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_theta_d_bound": 0.02,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": [
    "classifier",
    "classifier",
    "score"
  ],
  "peft_type": "UNILORA",
  "peft_version": null,
  "proj_seed": 19,
  "r": 4,
  "revision": null,
  "target_modules": [
    "value",
    "query",
    "key",
    "output.dense",
    "intermediate.dense"
  ],
  "task_type": "SEQ_CLS",
  "theta_d_length": 23040,
  "unilora_dropout": 0.0
}